Revit 2027 API
RepeaterBounds.AdjustForCyclicalBounds Method
 Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RepeaterCoordinates AdjustForCyclicalBounds(
	RepeaterCoordinates coordinates
)
Public Function AdjustForCyclicalBounds (
	coordinates As RepeaterCoordinates
) As RepeaterCoordinates
public:
RepeaterCoordinates^ AdjustForCyclicalBounds(
	RepeaterCoordinates^ coordinates
)
member AdjustForCyclicalBounds :
        coordinates : RepeaterCoordinates -> RepeaterCoordinates
Parameters
coordinates RepeaterCoordinates
 The coordinates.
Return Value
RepeaterCoordinates
 The adjusted coordinates.
Exceptions
Exception | Condition
ArgumentException |  The coordinates coordinates have incompatible number of dimensions.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The bounds must have at least one dimension.
Remarks
 The coordinates must have the same number of dimensions as the bounds. This method does not apply to zero dimensional bounds.
See Also
Reference
RepeaterBounds Class
Autodesk.Revit.DB Namespace